src/Enza.UTM.DataAccess.Services/Requests/CreateUELRecordProcess.st

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpm="http://schemas.enzazaden.com/Common/UEL/BPM" xmlns:v1="http://contract.enzazaden.com/uel/logging/v1">
  <soapenv:Header/>
  <soapenv:Body>
    <bpm:createUELRecordProcess>
      <v1:createUelRecord>
        <v1:EventType></v1:EventType>
        <v1:SubType></v1:SubType>
        <v1:Severity></v1:Severity>
        <v1:Environment>$Model.Environment$</v1:Environment>
        <v1:Location>$Model.Location$</v1:Location>
        <v1:EventCode></v1:EventCode>
        <v1:PID></v1:PID>
        <v1:ErrorDetailText>$Model.ErrorDetailText$</v1:ErrorDetailText>
        <v1:Userid>$Model.UserID$</v1:Userid>
        <v1:Application>$Model.Application$</v1:Application>
        <v1:instanceProperties>
          <v1:processName></v1:processName>
          <v1:processDescription>$Model.InstanceProperties.ProcessDescription$</v1:processDescription>
          <v1:identifier></v1:identifier>
          <v1:modelSpace></v1:modelSpace>
          <v1:monitor></v1:monitor>
          <v1:startedBy></v1:startedBy>
          <v1:currentOwner></v1:currentOwner>
          <v1:organization>$Model.InstanceProperties.Organization$</v1:organization>
          <v1:startTime></v1:startTime>
          <v1:processInstantiationType></v1:processInstantiationType>
          <v1:priority></v1:priority>
          <v1:parentType></v1:parentType>
          <v1:callerInstance></v1:callerInstance>
          <v1:rootInstance></v1:rootInstance>
          <v1:rootInstanceType></v1:rootInstanceType>
          <v1:activityInfo>
            <v1:activity>
              <v1:activityStatus></v1:activityStatus>
            </v1:activity>
          </v1:activityInfo>
        </v1:instanceProperties>
      </v1:createUelRecord>
    </bpm:createUELRecordProcess>
  </soapenv:Body>
</soapenv:Envelope>